Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/Microchip.PIC32CK-SG_DFP.pdsc
         <device Dname="PIC32CK1025SG00100">
            <processor Dcore="Cortex-M33"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="SP_FPU"
                       Dtz="TZ"
                       Ddsp="DSP"/>
            <compile header="PIC32CK-SG00/include/pic32c.h" define="__PIC32CK1025SG00100__"/>
            <memory id="IROM1" start="0x4000000" size="0x8000"/>
            <memory id="IROM2"
                    start="0x8000000"
                    size="0x20000"
                    default="1"
                    startup="1"/>
            <memory id="IROM3" start="0xA000000" size="0x1000"/>
            <memory id="IROM4" start="0xA002000" size="0x1000"/>
            <memory id="IROM5" start="0xA004000" size="0x1000"/>
            <memory id="IROM6" start="0xA006000" size="0x1000"/>
            <memory id="IROM7" start="0xA008000" size="0x1000"/>
            <memory id="IROM8" start="0xA00A000" size="0x1000"/>
            <memory id="IRAM1" start="0x0" size="0x1000" default="1"/>
            <memory id="IRAM2" start="0x1000" size="0x400"/>
            <memory id="IRAM3" start="0x3000" size="0x40"/>
            <memory id="IRAM4" start="0x10000000" size="0x10000000"/>
            <memory id="IRAM5" start="0x20000000" size="0x40000"/>
            <memory id="IRAM6" start="0x60000000" size="0x1000000"/>
            <memory id="IRAM7" start="0x61000000" size="0x1000000"/>
            <memory id="IRAM8" start="0x62000000" size="0x1000000"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="PIC32CK-SG00/atdf/PIC32CK1025SG00100.atdf"/>
                  <at:variant ordercode="PIC32CK1025SG00100-I/DD"
                              vccmin="1.71"
                              vccmax="3.60"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="PIC32CK1025SG00100-E/DD"
                              vccmin="1.71"
                              vccmax="3.60"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:memory name="CMCC_DATARAM"
                             start="0x0"
                             size="0x1000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="CMCC_TAGRAM"
                             start="0x1000"
                             size="0x400"
                             type="ram"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="CMCC_VALIDRAM"
                             start="0x3000"
                             size="0x40"
                             type="ram"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PRM_ROM"
                             start="0x4000000"
                             size="0x8000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FLASH_BFM"
                             start="0x8000000"
                             size="0x20000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_USERCFG1"
                             start="0xA000000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_USEROTP1"
                             start="0xA001000"
                             size="0x1000"
                             type="user_signatures"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_BOOTCFG1"
                             start="0xA002000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_DALCFG"
                             start="0xA004000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_CALBACKUP"
                             start="0xA006000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_CALOTP"
                             start="0xA007000"
                             size="0x1000"
                             type="other"
                             pagesize="4096"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_USERCFG2"
                             start="0xA008000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_USEROTP2"
                             start="0xA009000"
                             size="0x1000"
                             type="user_signatures"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FLASH_CFM_BOOTCFG2"
                             start="0xA00A000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FLASH_PFM"
                             start="0xC000000"
                             size="0x100000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="SQI_SFR"
                             start="0xFFFF000"
                             size="0x1000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SQI_XIP"
                             start="0x10000000"
                             size="0x10000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="HSRAM_RET"
                             start="0x20000000"
                             size="0x40000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="HPB0_BRIDGE"
                             start="0x44000000"
                             size="0x30000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HPB1_BRIDGE"
                             start="0x44800000"
                             size="0x30000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HPB2_BRIDGE"
                             start="0x45000000"
                             size="0x30000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="USBHS_SFR"
                             start="0x46000000"
                             size="0x1600"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HSM_SFR"
                             start="0x48000000"
                             size="0x1000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="EBI_CS0"
                             start="0x60000000"
                             size="0x1000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="EBI_CS1"
                             start="0x61000000"
                             size="0x1000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="EBI_CS2"
                             start="0x62000000"
                             size="0x1000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="EBI_CS3"
                             start="0x63000000"
                             size="0x1000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="PPB"
                             start="0xE0000000"
                             size="0x100000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="PIC32CK-SG00/edc/PIC32CK1025SG00100.PIC"/>
                  <mchp:xc32 name="PIC32CK-SG00/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="PIC32CK-SG00/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="PIC32CK-SG00/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="PIC32CK-SG00/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="PIC32CK-SG00/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CK1025SG00100"
                  title="Device page for PIC32CK1025SG00100"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CK1025SG00100"
                  title="Datasheet"/>
         </device>
