Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/Microchip.PIC32CK-SG_DFP.pdsc
      <condition id="PIC32CK2051SG00064">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051SG00064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051SG00100">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051SG00100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051SG00144">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051SG00144"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051SG01064">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051SG01064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051SG01100">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051SG01100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051SG01144">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051SG01144"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK0512SG00064">
         <description>Headers and startup code for Microchip PIC32CK0512SG00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/gcc/startup_pic32ck0512sg00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/system_pic32ck0512sg00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck0512sg00064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck0512sg00064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/armcc/startup_pic32ck0512sg00064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/system_pic32ck0512sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/iar/startup_pic32ck0512sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/system_pic32ck0512sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck0512sg00064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck0512sg00064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK0512SG00100">
         <description>Headers and startup code for Microchip PIC32CK0512SG00100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/gcc/startup_pic32ck0512sg00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/system_pic32ck0512sg00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck0512sg00100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck0512sg00100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/armcc/startup_pic32ck0512sg00100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/system_pic32ck0512sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/iar/startup_pic32ck0512sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/system_pic32ck0512sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck0512sg00100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck0512sg00100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK0512SG01064">
         <description>Headers and startup code for Microchip PIC32CK0512SG01064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/gcc/startup_pic32ck0512sg01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/system_pic32ck0512sg01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck0512sg01064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck0512sg01064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/armcc/startup_pic32ck0512sg01064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/system_pic32ck0512sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/iar/startup_pic32ck0512sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/system_pic32ck0512sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck0512sg01064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck0512sg01064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK0512SG01100">
         <description>Headers and startup code for Microchip PIC32CK0512SG01100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/gcc/startup_pic32ck0512sg01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/system_pic32ck0512sg01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck0512sg01100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck0512sg01100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/armcc/startup_pic32ck0512sg01100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/system_pic32ck0512sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/iar/startup_pic32ck0512sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/system_pic32ck0512sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck0512sg01100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck0512sg01100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK1025SG00064">
         <description>Headers and startup code for Microchip PIC32CK1025SG00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/gcc/startup_pic32ck1025sg00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/system_pic32ck1025sg00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck1025sg00064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck1025sg00064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/armcc/startup_pic32ck1025sg00064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/system_pic32ck1025sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/iar/startup_pic32ck1025sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/system_pic32ck1025sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck1025sg00064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck1025sg00064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK1025SG00100">
         <description>Headers and startup code for Microchip PIC32CK1025SG00100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/gcc/startup_pic32ck1025sg00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/system_pic32ck1025sg00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck1025sg00100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck1025sg00100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/armcc/startup_pic32ck1025sg00100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/system_pic32ck1025sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/iar/startup_pic32ck1025sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/system_pic32ck1025sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck1025sg00100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck1025sg00100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK1025SG01064">
         <description>Headers and startup code for Microchip PIC32CK1025SG01064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/gcc/startup_pic32ck1025sg01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/system_pic32ck1025sg01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck1025sg01064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck1025sg01064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/armcc/startup_pic32ck1025sg01064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/system_pic32ck1025sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/iar/startup_pic32ck1025sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/system_pic32ck1025sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck1025sg01064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck1025sg01064/flash.icf"
                  attr="config"/>
         </files>
      </component>
