Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/Microchip.PIC32CK-SG_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK1025SG01100">
         <description>Headers and startup code for Microchip PIC32CK1025SG01100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/gcc/startup_pic32ck1025sg01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/system_pic32ck1025sg01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck1025sg01100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck1025sg01100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/armcc/startup_pic32ck1025sg01100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/system_pic32ck1025sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/iar/startup_pic32ck1025sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/system_pic32ck1025sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck1025sg01100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck1025sg01100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK2051SG00064">
         <description>Headers and startup code for Microchip PIC32CK2051SG00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/gcc/startup_pic32ck2051sg00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/system_pic32ck2051sg00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck2051sg00064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck2051sg00064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/armcc/startup_pic32ck2051sg00064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/system_pic32ck2051sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/iar/startup_pic32ck2051sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/system_pic32ck2051sg00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck2051sg00064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck2051sg00064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK2051SG00100">
         <description>Headers and startup code for Microchip PIC32CK2051SG00100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/gcc/startup_pic32ck2051sg00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/system_pic32ck2051sg00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck2051sg00100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck2051sg00100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/armcc/startup_pic32ck2051sg00100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/system_pic32ck2051sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/iar/startup_pic32ck2051sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/system_pic32ck2051sg00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck2051sg00100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck2051sg00100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK2051SG00144">
         <description>Headers and startup code for Microchip PIC32CK2051SG00144</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/gcc/startup_pic32ck2051sg00144.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG00/gcc/system_pic32ck2051sg00144.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck2051sg00144_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG00/gcc/gcc/pic32ck2051sg00144_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/armcc/startup_pic32ck2051sg00144.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG00/armcc/system_pic32ck2051sg00144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/iar/startup_pic32ck2051sg00144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG00/iar/system_pic32ck2051sg00144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck2051sg00144/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG00/iar/config/linker/Microchip/pic32ck2051sg00144/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK2051SG01064">
         <description>Headers and startup code for Microchip PIC32CK2051SG01064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/gcc/startup_pic32ck2051sg01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/system_pic32ck2051sg01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck2051sg01064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck2051sg01064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/armcc/startup_pic32ck2051sg01064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/system_pic32ck2051sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/iar/startup_pic32ck2051sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/system_pic32ck2051sg01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck2051sg01064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck2051sg01064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK2051SG01100">
         <description>Headers and startup code for Microchip PIC32CK2051SG01100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/gcc/startup_pic32ck2051sg01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/system_pic32ck2051sg01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck2051sg01100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck2051sg01100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/armcc/startup_pic32ck2051sg01100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/system_pic32ck2051sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/iar/startup_pic32ck2051sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/system_pic32ck2051sg01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck2051sg01100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck2051sg01100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK2051SG01144">
         <description>Headers and startup code for Microchip PIC32CK2051SG01144</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-SG01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-SG01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-SG01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-SG01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/gcc/startup_pic32ck2051sg01144.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-SG01/gcc/system_pic32ck2051sg01144.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck2051sg01144_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-SG01/gcc/gcc/pic32ck2051sg01144_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/armcc/startup_pic32ck2051sg01144.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-SG01/armcc/system_pic32ck2051sg01144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/iar/startup_pic32ck2051sg01144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-SG01/iar/system_pic32ck2051sg01144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck2051sg01144/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-SG01/iar/config/linker/Microchip/pic32ck2051sg01144/flash.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
